maxgerhardt/framework-aurduino/aurduino/aurix/boards.txt


aurduino.name=ShieldBuddyTC275
aurduino.build.core=aurduino
aurduino.build.variant=TC275
aurduino.build.board=TC275_AURDUINO

aurduino.upload.tool=memtool
aurduino.upload.protocol=JTAG
aurduino.build.ldscript=linker_scripts/gcc/iROM.ld
aurduino.build.variant_system_lib=libiLLD_Lib_Make.a
aurduino.build.mcu=tc27xx

aurduino.vid.0=0x058B
aurduino.pid.0=0x0043

aurduino.vid.0x2A03.warning=Uncertified

aurduino.build.vid=0x058B
aurduino.build.pid=0x0043